app/controllers/articles_controller.rb

DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 2]]
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 2]]
---
  def destroy
    @article = Article.find(params[:id]).destroy